{
    "search_result": {
      "Text": {
        "CitationSources": [
          {
            "Id": "https://ztsolutions.io/insights/what-is-zero-trust-architecture-and-what-are-the-benefits",
            "Name": "What is Zero Trust Architecture, and what are the benefits?",
            "Text": "It is applied right before the user or machine accesses the asset they are requesting and based on principles of need to know, least privilege and, risk their access request poses to the business. ... Zero Trust can also improve the user experience and improve productivity. Zero Trust is context aware security that works on trust signals - this ...",
            "Type": "Unknown",
            "Url": "https://ztsolutions.io/insights/what-is-zero-trust-architecture-and-what-are-the-benefits"
          },
          {
            "Id": "cite:2",
            "Name": "NSTAC_Report-Zero_Trust_and_Trusted_Identity_Management.pdf",
            "Text": ". As a result, each subsequent protect surface can become more robust and better protected over time. ▪ Month-over-month true and false positive percentages for security incidents for zero trust deployments (to quantify efficacy and provide a closed feedback loop for zero trust technology and policy refinement) 3.1.2. Enhance Transparency and Support Continuous Improvement with a Progress Metric In addition to these five implementation steps, NSTAC also believes the Federal Government should adopt an additional tenet: Commit to Transparency and Continuous Improvement. To lead by example, it is vital that the Federal Government’s zero trust journey be as publicly transparent as possible. As agencies move through the five implementation steps, publicly documenting successes and lessons learned is critical to foster a culture of continuous improvement across public and private sector organizations in their zero trust journeys. To reinforce this ethos, NSTAC recommends OMB establish an additional reporting metric, requiring each agency to publish one Zero Trust use case annually, documenting implementation lessons learned (Table 6). In addition, OMB, working in conjunction with NIST, should convene an annual working group to review use case studies, and as appropriate, update existing zero trust guidelines and best practice standards accordingly. Table 6: Additional Tenet with Suggested Quantifiable Progress Metric Tenet Activities Quantifiable Progress Metric Commit to Transparency and Continuous Improvement Publicly document successes and lessons learned ▪ Document lessons learned in at least one zero trust use case (published annually) 3.1.3. Establish a Working Group to Develop Zero Trust Maturity Models for Key Federal Enterprise Infrastructure Services OMB can also play a vital role in assessing the most significant government-wide cybersecurity risks, to help agencies prioritize the assets most critical to protect with zero trust deployments. To this end, the NSTAC FINAL DRAFT NSTAC Report to the President • Zero Trust and Trusted Identity Management 13 recommends that OMB, working through the Federal CISO Council, undertake a comprehensive process to identify the federal enterprise infrastructure services that are: 1. Currently ubiquitous across federal agencies. 2. Likely to continue to be ubiquitous for at least the next five years. Once these services are identified, the NSTAC recommends that OMB establish an interagency working group, facilitated through the Federal CISO Council, to create corresponding Zero Trust Maturity Models for each service. These Zero Trust Maturity Models template can be modeled after the Directory Services use case the NSTAC created and is featured in Appendix B. 3.2. Address Governance Barriers and Enablers for a Sustained Federal Commitment to Zero Trust “Governance” encompasses all the systems by which an organization is controlled and operates, and the mechanisms by which it is held to account. In this report, this term describes all the budgetary, personnel, and accountability mechanisms that should be reformed or newly established to maintain zero trust as an integrated, sustained federal strategy over the long term. Each individual agency is ultimately responsible for modernizing their own cybersecurity postures consistent with zero trust principles in furtherance of EO 14028.44 However, the White House and those entities the EO tasks with aiding implementation must appropriately recognize the magnitude of this transformation challenge. Those implementing entities, including CISA and the General Services Administration (GSA), can take several concrete actions to assist and empower otherwise under-resourced agencies in implementing zero trust, discussed in the subsections below. Some of these recommended actions are acknowledged in the existing Federal Zero Trust Strategy,45 and some are newly articulated in this report. Ultimately, the key to successfully institutionalizing zero trust in the Federal Government is to keep it from being seen as just another new federal requirements by integrating its principles into existing workstreams. Zero trust principles should be cemented into the core of existing and new federal governance structures, policies, and programs. As the Federal Government adopts new technologies, modernizes or incrementally maintains systems, and adopts new information security policies, zero trust needs to be a central tenet for managing cybersecurity risk. 44 EO 14028: Improving the Nation’s Cybersecurity, The White House, May 12, 2021, https://www.whitehouse.gov/briefing- room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/. 45 OMB, M-22-09: Moving the U.S. Government Toward Zero Trust Cybersecurity Principles, The White House, January 26, 2022, https://www.whitehouse.gov/wp-content/uploads/2022/01/M-22-09.pdf",
            "Type": "Unknown",
            "Url": ""
          }
        ],
        "Content": "To boost your security with zero trust principles, you can follow these steps:\n\n1. Implement the principle of least privilege by ensuring that users and machines only have access to the resources they need.\n2. Continuously verify each access request based on the context and risk it poses to your business.\n3. Use context-aware security that works on trust signals to improve user experience and productivity [1].\n4. Document successes and lessons learned in at least one zero trust use case annually to foster continuous improvement [2].\n5. Establish a working group to develop zero trust maturity models for key infrastructure services [2].\n6. Integrate zero trust principles into your existing cybersecurity policies and governance structures [2].\n\nBy following these steps, you can create a more robust and secure environment.",
        "MarkdownContent": "To boost your security with zero trust principles, you can follow these steps:\n\n1. Implement the principle of least privilege by ensuring that users and machines only have access to the resources they need.\n2. Continuously verify each access request based on the context and risk it poses to your business.\n3. Use context-aware security that works on trust signals to improve user experience and productivity [1].\n4. Document successes and lessons learned in at least one zero trust use case annually to foster continuous improvement [2].\n5. Establish a working group to develop zero trust maturity models for key infrastructure services [2].\n6. Integrate zero trust principles into your existing cybersecurity policies and governance structures [2].\n\nBy following these steps, you can create a more robust and secure environment.\n\n[1]: https://ztsolutions.io/insights/what-is-zero-trust-architecture-and-what-are-the-benefits \"What is Zero Trust Architecture, and what are the benefits?\"\n[2]: cite:2 \"Citation-2\""
      }
    }
  }